{
  "enhancedcombathud-sw5e": {
    "portraitConfig": {
      "prepared": {
        "label": "Prepared Powers",
        "auto": "Auto Detect",
        "preparedOnly": "Prepared Only",
        "all": "All Powers"
      }
    },
    "settings": {
      "switchEquip": {
        "name": "Auto Equip",
        "hint": "Automatically equip/unequip items when switching sets"
      },
      "showWeaponsItems": {
        "name": "Show Weapons in 'Use Item' Section",
        "hint": "Show weapons in the 'Use Item' section. Usefull if your weapon slots are not enough"
      },
      "showClassActions": {
        "name": "Show Class Actions",
        "hint": "Show class actions in the Main Action bars"
      },
      "condenseClassActions":{
        "name": "Condense Class Actions",
        "hint": "If 'Show Class Actions' is enabled, condense class actions in pairs to save space"
      },
      "noAA": {
        "name": "Don't Apply Active Effects",
        "hint": "Don't apply active effects when using special actions. (requires refresh)"
      },
      "showSpecialActions": {
        "name": "Show Basic Actions",
        "hint": "Show basic actions in the Main Action section. (Dodge, Dash, Disengage, Hide, Ready, Shove)"
      }
    },
    "hud": {
      "mainactions": {
        "name": "Main Action"
      },
      "castpower": {
        "name": "Cast Power"
      },
      "usemaneuver": {
        "name": "Use Maneuver"
      },
      "usefeature": {
        "name": "Use Feature"
      },
      "useitem": {
        "name": "Use Item"
      },
      "bonusaction": {
        "name": "Bonus"
      },
      "reaction": {
        "name": "Reaction"
      },
      "specialaction": {
        "name": "Free"
      },
      "pass": {
        "name": "Pass"
      },
      "endturn": {
        "name": "End Turn"
      },
      "hp": {
        "name": "HP"
      },
      "ac": {
        "name": "AC"
      },
      "of": {
        "name": "of"
      },
      "inventory": {
        "name": "Sheet"
      },
      "saves": {
        "name": "Saves"
      },
      "skills": {
        "name": "Skills"
      },
      "tools": {
        "name": "Tools"
      }
    },
    "items": {
      "dash": {
        "name": "Dash",
        "desc": "<p>When you take the Dash action, you gain extra movement for the current turn. The increase equals your speed, after applying any modifiers. With a speed of 30 feet, for example, you can move up to 60 feet on your turn if you dash.</p>\n<p>Any increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash.</p>"
      },
      "disengage": {
        "name": "Disengage",
        "desc": "<p>If you take the Disengage action, your movement doesn't provoke opportunity attacks for the rest of the turn.</p>"
      },
      "dodge": {
        "name": "Dodge",
        "desc": "<p>When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage. You lose this benefit if you are incapacitated or if your speed drops to 0.</p>"
      },
      "hide": {
        "name": "Hide",
        "desc": "<p>When you take the Hide action, you make a Dexterity (Stealth) check in an attempt to hide, following the rules for hiding. If you succeed, you gain certain benefits.</p>\n<p>Combatants often try to escape their foes' notice by hiding, casting the invisibility power, or lurking in darkness.</p>\n<p>When you attack a target that you can't see, you have disadvantage on the attack roll. This is true whether you're guessing the target's location or you're targeting a creature you can hear but not see. If the target isn't in the location you targeted, you automatically miss, but the DM typically just says that the attack missed, not whether you guessed the target's location correctly.</p>\n<p>When a creature can't see you, you have advantage on attack rolls against it. If you are hidden--both unseen and unheard--when you make an attack, you give away your location when the attack hits or misses.</p>\n<p> </p>"
      },
      "grapple": {
        "name": "Grapple",
        "desc": "<p>When you want to grab a creature or wrestle with it, you can use the Attack action to make a special melee attack, a <strong>grapple</strong>. If you’re able to make multiple attacks with the Attack action, this attack replaces one of them.</p>\n<p>The target of your grapple must be no more than one size larger than you, and it must be within your reach. Using at least one free hand, which is occupied for the duration of the grapple, you try to seize the target by making a Strength (Athletics) check contested by the target’s Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). If you succeed, you subject the target to the grappled condition. The condition specifies the things that end it, and you can release the target whenever you like (no action required).</p>\n<p><strong><i>Escaping a Grapple.</i></strong> A grappled creature can use its action to escape. To do so, it must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check contested by your Strength (Athletics) check.</p>\n<p><strong><i>Moving a Grappled Creature.</i></strong> When you move, you can drag or carry the grappled creature with you, but your speed is halved, unless the creature is two or more sizes smaller than you.</p>"
      },
      "shove": {
        "name": "Shove",
        "desc": "<p>Using the Attack action, you can make a special melee attack to <strong>shove</strong> a creature to push it away from you, or to <strong>trip</strong> a creature to knock it prone. If you’re able to make multiple attacks with the Attack action, this attack replaces one of them.</p>\n<p>The target of your shove or trip must be no more than one size larger than you, and it must be within your reach. You make a Strength (Athletics) check contested by the target’s Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). If you win the contest, you either shove the target 5 feet away from you or trip it prone.</p>"
      },
      "guard": {
        "name": "Guard",
        "desc": "<p>You can defend an ally within 5 feet of you. When you take the Guard action, you focus entirely on preventing attacks from reaching your ally. Until the start of your next turn, any attack roll made against the guarded ally has disadvantage if you can see the attacker, as long as the ally is within 5 feet of you.</p>\n<p>Additionally, if an attack would hit the guarded ally, you can instead have it hit you (no action required). If you do so, the attacker chooses the maximum amount of damage instead of rolling.</p>"
      },
      "help": {
        "name": "Help",
        "desc": "<p>You can lend your aid to an ally in the completion of a task. When you take the Help action, the ally you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn.</p>\n<p>Alternatively, you can aid an ally in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective. If your ally attacks the target before your next turn, the first attack roll is made with advantage.</p>"
      },
      "ready": {
        "name": "Ready",
        "desc": "<p>Sometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your reaction before the start of your next turn.</p>\n<p>First, you decide what perceivable circumstance will trigger your reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your speed in response to it. Examples include \"If the soldier steps on the trapdoor, I'll pull the lever that opens it,\" and \"If the gamorrean steps next to me, I move away.\"</p>\n<p>When the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger. Remember that you can take only one reaction per round.</p>\n<p>When you ready a power, you cast it as normal but hold its energy, which you release with your reaction when the trigger occurs. To be readied, a power must have a casting time of 1 action, and holding onto the power's effect requires concentration. If your concentration is broken, the power dissipates without taking effect. For example, if you are concentrating on the <i>knight speed</i> power and ready <i>shock</i>, your <i>knight speed</i> power ends, and if you take damage before you release <i>shock</i> with your reaction, your concentration might be broken.</p>"
      },
      "search": {
        "name": "Search",
        "desc": "<p>When you take the Search action, you devote your attention to finding something. Depending on the nature of your search, the GM might have you make a Wisdom (Perception) check or an Intelligence (Investigation) check.</p>"
      }
    },
    "skills": {
      "acr": {
        "tooltip": "Your Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The DM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips."
      },
      "ani": {
        "tooltip": "When there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal's intentions, the DM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver."
      },
      "ath": {
        "tooltip": "<p>Your Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities:</p><ul><li>You attempt to climb a sheer or slippery cliff, avoid hazards while scaling a wall, or cling to a surface while something is trying to knock you off.</li>↵<li>You try to jump an unusually long distance or pull off a stunt midjump.</li><li>You struggle to swim or stay afloat in treacherous currents, storm-tossed waves, or areas of thick seaweed. Or another creature tries to push or pull you underwater or otherwise interfere with your swimming.</li>↵</ul>"
      },
      "dec": {
        "tooltip": "Your Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast-talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie."
      },
      "ins": {
        "tooltip": "Your Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone's next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms."
      },
      "itm": {
        "tooltip": "When you attempt to influence someone through overt threats, hostile actions, and physical violence, the DM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision."
      },
      "inv": {
        "tooltip": "When you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check."
      },
      "lor": {
        "tooltip": "Your Intelligence (Lore) check measures your ability to recall information about the Force, artifacts, histories, and religions."
      },
      "med": {
        "tooltip": "A Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness."
      },
      "nat": {
        "tooltip": "Your Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles."
      },
      "pil": {
        "tooltip": "Your Intelligence (Piloting) check measures your ability to control vehicles, aircraft, and spaceships. Piloting governs your ability to maneuver through tight spaces and debris fields or dogfight with enemy craft."
      },
      "prc": {
        "tooltip": "Your Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door."
      },
      "prf": {
        "tooltip": "Your Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment."
      },
      "per": {
        "tooltip": "When you attempt to influence someone or a group of people with tact, social graces, or good nature, the DM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk."
      },
      "slt": {
        "tooltip": "Whenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The DM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket."
      },
      "ste": {
        "tooltip": "Make a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard."
      },
      "sur": {
        "tooltip": "The GM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that rancors live nearby, predict the weather, or avoid quicksand and other natural hazards."
      },
      "tec": {
        "tooltip": "Your Intelligence (Technology) checks measure your ability to recall information about droids, vehicles, spaceships, aircraft, and computers, as well as your ability to interface with them. Technology can also be used to stabilize a droid or construct."
      }
    },
    "abilities": {
      "str": {
        "tooltip": "<p>Strength measures bodily power, athletic training, and the extent to which you can exert raw physical force.</p><p><strong>Strength Checks</strong><br/>A Strength check can model any attempt to lift, push, pull, or break something, to force your body through a space, or to otherwise apply brute force to a situation. The Athletics skill reflects aptitude in certain kinds of Strength checks.</p><p><strong>Other Strength Checks</strong><br/>The DM might also call for a Strength check when you try to accomplish tasks like the following:<ul><li>Force open a stuck, locked, or barred door</li><li>Break free of bonds</li><li>Push through a tunnel that is too small</li><li>Hang on to a wagon while being dragged behind it</li><li>Tip over a statue</li><li>Keep a boulder from rolling</li></ul></p><p><strong>Lifting and Carrying</strong><br/> Your Strength score determines the amount of weight you can bear. The following terms define what you can lift or carry.</p><p><strong>Carrying Capacity.</strong> Your carrying capacity is your Strength score multiplied by 15. This is the weight (in pounds) that you can carry, which is high enough that most characters don't usually have to worry about it.</p><p><strong>Push, Drag, or Lift.</strong> You can push, drag, or lift a weight in pounds up to twice your carrying capacity (or 30 times your Strength score). While pushing or dragging weight in excess of your carrying capacity, your speed drops to 5 feet.</p><p><strong>Size and Strength.</strong> Larger creatures can bear more weight, whereas Tiny creatures can carry less. For each size category above Medium, double the creature's carrying capacity and the amount it can push, drag, or lift. For a Tiny creature, halve these weights.</p>"
      },
      "dex": {
        "tooltip": "<p>Dexterity measures agility, reflexes, and balance.</p><p><strong>Dexterity Checks</strong><br/>A Dexterity check can model any attempt to move nimbly, quickly, or quietly, or to keep from falling on tricky footing. The Acrobatics, Sleight of Hand, and Stealth skills reflect aptitude in certain kinds of Dexterity checks.</p><p><strong>Other Dexterity Checks</strong><br/>The DM might call for a Dexterity check when you try to accomplish tasks like the following:<ul><li>Control a heavily laden cart on a steep descent</li><li>Steer a chariot around a tight turn</li><li>Pick a lock</li><li>Disable a trap</li><li>Securely tie up a prisoner</li><li>Wriggle free of bonds</li><li>Play a stringed instrument</li><li>Craft a small or detailed object</li></ul></p><p><strong>Armor Class</strong><br/>Depending on the armor you wear, you might add some or all of your Dexterity modifier to your Armor Class, as described in chapter 5, Equipment.</p><p><strong>Initiative</strong><br/>At the beginning of every combat, you roll initiative by making a Dexterity check. Initiative determines the order of creatures' turns in combat, as described in chapter 9, <a class='entity-link' data-pack='sw5e.rules' data-id='3V8ywGHQEpbZpsIL'>Combat.</a>"
      },
      "con": {
        "tooltip": "<p>Constitution measures health, stamina, and vital force.</p><p><strong>Constitution Checks</strong><br/>Constitution checks are uncommon, and no skills apply to Constitution checks, because the endurance this ability represents is largely passive rather than involving a specific effort on the part of a character or monster. A Constitution check can model your attempt to push beyond normal limits, however.</p><p>The DM might call for a Constitution check when you try to accomplish tasks like the following:<ul><li>Hold your breath</li><li>March or labor for hours without rest</li><li>Go without sleep</li><li>Survive without food or water</li><li>Quaff an entire stein of ale in one go</li></ul></p><p><strong>Hit Points</strong><br/>Your Constitution modifier contributes to your hit points. Typically, you add your Constitution modifier to each Hit Die you roll for your hit points.</p><p>If your Constitution modifier changes, your hit point maximum changes as well, as though you had the new modifier from 1st level. For example, if you raise your Constitution score when you reach 4th level and your Constitution modifier increases from +1 to +2, you adjust your hit point maximum as though the modifier had always been +2. So you add 3 hit points for your first three levels, and then roll your hit points for 4th level using your new modifier. Or if you're 7th level and some effect lowers your Constitution score so as to reduce your Constitution modifier by 1, your hit point maximum is reduced by 7.</p>"
      },
      "int": {
        "tooltip": "<p>Intelligence measures mental acuity, accuracy of recall, and the ability to reason.</p><p><strong>Intelligence Checks</strong><br/>An Intelligence check comes into play when you need to draw on logic, education, memory, or deductive reasoning. The Arcana, History, Investigation, Nature, and Religion skills reflect aptitude in certain kinds of Intelligence checks.</p><p><strong>Other Intelligence Checks</strong><br/>The DM might call for an Intelligence check when you try to accomplish tasks like the following:<ul><li>Communicate with a creature without using words</li><li>Estimate the value of a precious item</li><li>Pull together a disguise to pass as a city guard</li><li>Forge a document</li><li>Recall lore about a craft or trade</li><li>Win a game of skill</li></ul></p>"
      },
      "wis": {
        "tooltip": "<p>Wisdom reflects how attuned you are to the world around you and represents perceptiveness and intuition.</p><p><strong>Wisdom Checks</strong>A Wisdom check might reflect an effort to read body language, understand someone’s feelings, notice things about the environment, or care for an injured person. The Animal Handling, Insight, Medicine, Perception, and Survival skills reflect aptitude in certain kinds of Wisdom checks.</p><p><strong>Other Wisdom Checks</strong></br>The DM might call for a Wisdom check when you try to accomplish tasks like the following:<ul><li>Get a gut feeling about what course of action to follow</li><li>Discern whether a seemingly dead or living creature is undead</li></ul></p>"
      },
      "cha": {
        "tooltip": "<p>Charisma measures your ability to interact effectively with others. It includes such factors as confidence and eloquence, and it can represent a charming or commanding personality.</p><p><strong>Other Charisma Checks</strong><br/>The DM might call for a Charisma check when you try to accomplish tasks like the following:<ul><li>Find the best person to talk to for news, rumors, and gossip</li><li>Blend into a crowd to get the sense of key topics of conversation</li></ul></p>"
      }
    },
    "tooltip": {
      "target": {
        "name": "Target"
      },
      "range": {
        "name": "Range"
      },
      "properties": {
        "name": "Properties"
      },
      "toHit": {
        "name": "To Hit"
      },
      "damage": {
        "name": "Damage"
      }
    }
  }
}